{
    "PROJECT_NAME": "Diabetes Multiclassification",
    "GITHUB_USERNAME": "Sambonic",
    "REPO_NAME": "diabetes-multiclassification",
    "PROJECT_DESCRIPTION": "Diabetes multiclassification using various machine learning algorithms ",
    "PROJECT_FEATURES": "- **Diabetes Multi-classification:** Predicts diabetes severity (no diabetes, pre-diabetes, diabetes) using machine learning.\n- **Data Preprocessing:** Handles missing values using mean/mode imputation and outlier adjustments, and explores different imputation strategies (KNN, mean/median/mode).\n- **Data Balancing:** Addresses class imbalance using undersampling of the majority class and oversampling of minority classes with SMOTENC (handling categorical features).\n- **Feature Selection:** Employs Chi-squared test and Random Forest feature importance to select relevant features.\n- **Model Training:** Trains and evaluates multiple classification models: Random Forest, Decision Tree, LightGBM, and Logistic Regression.\n- **Model Evaluation:**  Uses various metrics (accuracy, precision, recall, F1-score) and visualizes results with confusion matrices and ROC curves.\n- **Hyperparameter Tuning:** Optimizes model hyperparameters using `RandomizedSearchCV`.\n- **Learning Curve Analysis:**  Plots learning curves to assess model bias and variance.\n- **Comparative Analysis:**  Compares model performance with and without feature selection and hyperparameter tuning across multiple algorithms.\n\n",
    "PROJECT_USAGE": "To utilize this diabetes classification project:\n\n1.  **Run the notebook:** Execute the Jupyter Notebook (`diabetes_classification_ml.ipynb`).  The notebook will perform the following actions automatically:\n\n    *   Load the diabetes dataset.\n    *   Perform exploratory data analysis (EDA), including data type checking, statistical analysis, visualization of missing values and class distributions, and correlation analysis.\n    *   Handle missing values using mode imputation for categorical features and median imputation for numerical features. Evaluate different imputation methods.\n    *   Handle outliers in the 'BMI' feature using IQR.\n    *   Discretize the 'BMI' feature into meaningful categories.\n    *   Balance the dataset using undersampling and oversampling techniques (SMOTENC).\n    *   Perform feature selection using Chi-squared test and Random Forest feature importance.\n    *   Train several classification models (Random Forest, Decision Tree, LightGBM, Logistic Regression) with and without feature selection and hyperparameter tuning.\n    *   Evaluate model performance using various metrics (accuracy, precision, recall, F1-score) and visualize results using learning curves, confusion matrices, and ROC curves.\n    *   Compare different model performance.\n\n2.  **Interpret results:** The notebook will generate various visualizations and metrics that show the performance of different models under different conditions (with/without feature selection, with/without hyperparameter tuning).  Based on the results, one can determine which model performs best for diabetes classification.\n\n\n"
}